documentation/design/essn/SubjectManagement/UpdateSubjectStateRequest.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:sub="http://enterpriseservices.nci.nih.gov/SubjectManagementService"
	xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:ent="http://enterpriseservices.nci.nih.gov"
	xmlns:iso="uri:iso.org:21090"
	xsi:schemaLocation="uri:iso.org:21090 ISO_datatypes_Narrative.xsd http://enterpriseservices.nci.nih.gov SubjectManagement.xsd">
	<soapenv:Header />
	<soapenv:Body>
		<sub:UpdateSubjectStateRequest>
			<biologicEntityIdentifier>
				<ent:effectiveDateRange nullFlavor="NI" />
				<ent:identifier extension="001" identifierName="MRN" />
				<ent:typeCode code="MRN" />
				<ent:assigningOrganization>
					<ent:organizationIdentifier>
						<ent:identifier extension="MN026" />
						<ent:primaryIndicator value="true" />
						<ent:typeCode code="CTEP" />
					</ent:organizationIdentifier>
				</ent:assigningOrganization>
			</biologicEntityIdentifier>
			<newState value="ACTIVE">
			</newState>
		</sub:UpdateSubjectStateRequest>
	</soapenv:Body>
</soapenv:Envelope>